Revit 2024 API
SunAndShadowSettings.Altitude Property
 Altitude setting (angle in radians). This is only relevant when dealing with a SunAndShadowSettings element that uses lighting mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public double Altitude { get; set; }
Visual Basic
Public Property Altitude As Double
	Get
	Set
Visual C++
public:
property double Altitude {
	double get ();
	void set (double value);
}
Field Value
 Altitude angle (radians)
See Also
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace